[
    {
        "id": "78281592-335d-44ca-b701-272829d1b12c",
        "rating": 5,
        "title": "State-of-the-art for custom visuals",
        "content": "A very powerful visual that allows you to create custom visualizations without the need to develop a brand-new Power BI visual.",
        "created_at": "2025-01-13T09:54:58.8557694Z"
    },
    {
        "id": "568fade8-6e0e-4ad9-a209-519ea8dedca7",
        "rating": 5,
        "title": "This may be the only visualization you need!",
        "content": "This is a general-purpose visual, and can be configured to do almost anything.  In the future it may be the only visual needed - see https://maxpowerbi.pro/when-ai-meets-bi-how-artificial-intelligence-may-change-power-bi-development/",
        "created_at": "2024-12-24T11:33:43.0242189Z"
    },
    {
        "id": "42c3cdfc-d542-4f1a-932c-d4c626a55e95",
        "rating": 5,
        "title": "Absolutely love it",
        "content": "For advanced PBI users, this visual is godsend! It is not just 1 type of visual, but many type of visuals based on a lite programming language. With this tool you can use your imagination, and it is free! \n\nI just want to thank the author for sharing this amazing tool with us. ",
        "created_at": "2024-11-20T23:38:52.5305597Z"
    },
    {
        "id": "5df51085-5803-440d-8cc7-b04f7df808bf",
        "rating": 5,
        "title": "This is the best visual for power bi",
        "content": "I was frustrated using the core visuals in power bi because of the limits of customisation - so I tried a few visuals that came close to what I wanted but still had to do inelegant work arounds.  Finally found this and it was a life changer.  It it is in a class of its own in terms of customisation, imagination is the limit, and a dream to not have to use the clicky-clicky menu method to make visuals.  I started with vega-lite and then moved onto vega as I wanted more freedom.  This is the power user's final fantasy, I wish the power bi team would give it some love and integrate it directly with power bi.  My utmost wish is that the power bi team allow deneb to load multiple datasets instead of just one as it is such a pain to have to combine datasets into a single dataset all the time.  Also that the power bi team allow more freedom to sharing signals.  With these two things power bi would become a awesome tool as well as a popular tool.",
        "created_at": "2024-11-20T20:21:02.9222366Z"
    },
    {
        "id": "2f66c5f1-5786-423d-90fd-1d8242a4454d",
        "rating": 5,
        "title": "Life-saviour visual to build custom graphs",
        "content": "Finally a visual that let's you freely define a visual the way you need it to be. And thanks to Daniel for continuously bringing even further improvements!",
        "created_at": "2024-07-10T23:54:09.5951884Z"
    },
    {
        "id": "3a3a009d-cf6c-468d-8b9d-e86345d64224",
        "rating": 5,
        "title": "Fantastic Tool for Unique Visuals",
        "content": "This is a great tool to allow you to expand beyond the basic visuals without having to mess with Python or R.",
        "created_at": "2024-06-20T13:05:16.5285812Z"
    },
    {
        "id": "36967590-4a4a-4602-99fd-a89680be0b9a",
        "rating": 5,
        "title": "With Deneb you can put all your ideas into a visual",
        "content": "What an awesome visual this is! If you come from R or python and are used to create plots exactly as per your liking with just a few lines of code, then you will love Deneb. \nWe switched from a number of python visuals to Deneb and the Deneb visuals perform about 30x faster than the python visuals, are interactive and  thanks to the included dev environment, they are even easy to develop. It is amazing what you can do with Deneb.",
        "created_at": "2024-02-13T07:51:01.2591789Z"
    },
    {
        "id": "7ecbcd7d-65f8-40a4-a435-a014a62a9313",
        "rating": 5,
        "title": "Powerful visualization visuals",
        "content": "You can build any custom visual you can imagine by using a JSON oriented syntax. Thank you Daniel for bringing such a great tool visual to the BI world.",
        "created_at": "2024-01-18T03:19:50.6260201Z"
    },
    {
        "id": "df8940d3-a157-4bbe-9a98-c057fdd5e566",
        "rating": 5,
        "title": "Makes the best out of Vega and Power BI",
        "content": "I agree with a previous review \"Daniel brought that magic to PowerBI\". Indeed Deneb makes the best out of the combination of Vega and Power BI. It provides the visualization itself including methods for interaction between Vega and other visuals, and it contains a dev environment with editor and data preview. Finally documentation in https://deneb-viz.github.io/ is also very helpful.",
        "created_at": "2023-11-13T14:29:24.2389978Z"
    },
    {
        "id": "5642e216-d8b8-4a79-bbef-8897db084511",
        "rating": 5,
        "title": "Must-have visual for pro Power BI user",
        "content": "This is amazing when you have some basic understanding of Vega-lite/Vega code. \n\nIn fact, you can learn a bit of codes along the way to create awesome visuals inside. \n\nThis should be the part of Power BI official visual (pre-installed) one day and should grow with Power BI. This deserves more wide attention.\n\nMany thanks to Daniel. Please keep up the good work!\nAnd also to University of Washington team who developed Vega-lite!",
        "created_at": "2023-06-27T06:36:41.4867411Z"
    },
    {
        "id": "07991e95-bcc3-1e0c-1950-4b2f69bcdd32",
        "rating": 5,
        "title": "Most important visual in Power BI",
        "content": "Power BI has always lagged behind Tableau in ability to make excellent visuals. With Deneb, Power BI has finally caught up to Tableau. To make excellent visuals in Tableau takes work. So does Vega, but I find Vega easier. Thank you DMP for your excellent implementation in Power BI! You are the brightest star in AppSource! ",
        "created_at": "2022-12-07T00:22:56.4238535Z"
    },
    {
        "id": "c744848e-e20b-a0b2-495b-b0a7a4662167",
        "rating": 5,
        "title": "Best visual for Power BI",
        "content": "Deneb is the best custom visual existing for PowerBI. It allows such flexibility and breaks many barriers from native visuals. Thanks Daniel for putting all the effort to make it available!",
        "created_at": "2022-10-11T16:06:14.5559749Z"
    },
    {
        "id": "042e21e7-c424-fd35-f2de-289650a8f50a",
        "rating": 5,
        "title": "Visual with a wide range of applications",
        "content": "Great visual that allows great flexibility in customisation. Thanks for the great work.",
        "created_at": "2022-06-15T14:20:54.8201241Z"
    },
    {
        "id": "b36d7dd9-8f47-503a-8ead-9169592634a7",
        "rating": 5,
        "title": "Most Extensible Visual Out There",
        "content": "This is an incredible visual. You can build very highly customized visuals.\n\nOne feature I really enjoy is the ability to add interactivity within a visual.  An example would be a line that highlights data points on a line chart. The line allows users to see what they have selected for viewing a tooltip. \n\nI am super impressed with the speed and performance of this visual as well.  It feels much faster then comparable visuals such as Charticulator. ",
        "created_at": "2022-03-29T22:45:21.5428831Z"
    },
    {
        "id": "abe7c5ef-18b2-a3b8-3ced-000ed59d86e0",
        "rating": 5,
        "title": "the Magic of Vega-lite for everyone",
        "content": "I have used vega-lite on other BI tool before, and I know how powerful it is, \nI was very pleased when Daniel finally brought that magic to PowerBI,  now you can build any Viz you can imagine and the vega-lite is not too hard (probably all you need is to copy an existing code or just slightly changed it for your specific case) ",
        "created_at": "2022-03-02T03:43:40.4968845Z"
    },
    {
        "id": "5f89ecc6-dc4b-7960-afc7-99fa325ee315",
        "rating": 5,
        "title": "AMAZING Bespoke Visual Designer",
        "content": "Simply put, a game changing tool to build out custom visuals with only basic knowledge of the tool and using the vega-lite language for visuals. It's enhanced MANY of my reports. Well done Daniel",
        "created_at": "2022-03-02T02:46:01.078424Z"
    },
    {
        "id": "d74027f2-4567-5657-c3f1-45b39db4d391",
        "rating": 5,
        "title": "Great custom visual",
        "content": "Deneb is amazing! More intuitive than Charticulator and without the limitations of R and Python visuals.",
        "created_at": "2022-01-27T21:36:39.4928212Z"
    },
    {
        "id": "42093de4-8447-53e7-b305-a8e929ec9d48",
        "rating": 5,
        "title": "Best Custom Visual",
        "content": "The best, without a doubt. The freedom to create fantastic visuals is amazing. I had never heard of vega until I discovered deneb and now I can't get enough of it. An absolute must-have visual. It has a bit of a learning curve, and some effort, but truly worth it. Power BI needed this.",
        "created_at": "2022-01-08T21:55:27.6826998Z"
    },
    {
        "id": "557676a0-67a3-0047-ac00-a7d8101ee09d",
        "rating": 5,
        "title": "Game Changing",
        "content": "Deneb gives report creators complete freedom to express their creativity and brings Power BI much closer to the visualisation capabilities of Tableau (or surpass it). Both Vega and Vega-Lite are incredible frameworks for charting data with lots of easy to follow examples and I will use this on every project to wow my clients. ",
        "created_at": "2021-12-08T21:48:52.6986983Z"
    }
]